program(7)
. <identifier>(1)
. . simple(0)
. consts(0)
. types(0)
. dclns(1)
. . var(2)
. . . <identifier>(1)
. . . . x(0)
. . . <identifier>(1)
. . . . integer(0)
. subprogs(0)
. block(2)
. . assign(2)
. . . <identifier>(1)
. . . . x(0)
. . . <integer>(1)
. . . . 5(0)
. . output(1)
. . . integer(1)
. . . . <identifier>(1)
. . . . . x(0)
. <identifier>(1)
. . simple(0)
